"""
The module represents messages that the bot uses in its work.
"""

# ************************************************************************************************
#                                     TYPES OF BOT MEMBERS
# ************************************************************************************************
SUPERUSER = 'Керівник'
ADMIN = 'Адміністратор'
ADMIN_BADGE = '👩‍💼'
EMPLOYEE = 'Майстер'
EMPLOYEE_BADGE = '✂️'
STAFF = 'Персонал'
STAFF_BADGE = '👨‍👨‍👧‍👧'

# ************************************************************************************************
#                                       START GREETING
# ************************************************************************************************
__BOT_GREETING = '''
Радий вітати тебе 👋
Я бот, що допоможе тобі переглядати свої робочі записи.
Ти зможеш легко та швидко дізнатись від мене графік роботи на сьогодні чи завтра, 
цього тижня чи наступного.
Більше того, можу надавати тобі записи за різний період.
Якщо хочеш, щоб я став твоїм помічником, то скоріше
тисни на кнопку "Розпочати" в нижній частині екрану і почнемо 🤓
'''

# ************************************************************************************************
#                                   THE MEMBERSHIP MESSAGES
# ************************************************************************************************
MEMBERSHIP_START = '''
Приємно познайомитись, <b>%s</b> 🖖 
'''
ROLE_SELECTION = '''
Скажи мені, до якої категорії персоналу ти відносишся? 
'''
CONFIRM_APPLICANT_ROLE = '''
Твоя категорія — <b>%s</b>.
Чи все вірно я зрозумів?  
'''
SEND_CONTACT = '''
Як ти розумієш, інформація з графіками роботи майстрів є <b>конфіденційною</b>. \
Щоб отримати доступ %s салону має перевірити твій контакт і авторизувати тебе.

<i>В нижній частині екрану з'явилася кнопка <b>Відправити контакт для авторизації</b>, \
якщо ти її не бачиш, розшир клавіатуру, натиснувши на відповідну іконку \
з зображенням клавіатури, при цьому поле вводу тексту має бути пустим.</i>     
'''
ACCESS_ADMIN = f"{ADMIN.capitalize()}а, {SUPERUSER}"
ACCESS_EMPLOYEE = f"до свого розкладу, {ADMIN}"
WAIT_FOR_ANSWER = '''
Твій контакт відправлено на перевірку, чекай на відповідь...
'''
MEMBERSHIP_REQUEST = f'''
👆 👆 👆 <b>%s</b>
надсилає запит на приєднання до категорії <b>%s</b>.
'''
MISSING_FREE_FILES = '''
<i>Але в Google папці відсутній файл з графіком його роботи!
Ти можеш надати доступ зараз, а файл створити пізніше.</i>
'''
MEMBER_FILE_SELECTION = '''
Контакт приєднується до категорії Майстер.
Закріпи за ним Google файл з графіком його роботи.
<i>Якщо серед них немає необхідного, ти можеш зараз надати доступ до бота, а файл \
створити та закріпити пізніше</i> 
'''
MEMBER_FILE_CONFIRMATION = '''
🗓 За контактом закріплюється файл: <b>%s</b>
'''
EMPLOYEE_WITHOUT_FILE_ACCEPTANCE_CONFIRMATION = '''
📈 Контакт приєднується до категорії Майстер, але файл з графіком його роботи буде створено і \
закріплено за ним пізніше
'''
ADMIN_ACCEPTANCE_CONFIRMATION = '''
👩‍💼 Контакту надається доступ <b>Адміністратора</b>
'''
MEMBERSHIP_REJECTION_CONFIRMATION = '''
🚷️ Контакт буде внесено до <b>чорного списку</b> та відмовлено у доступі 
'''
ASKING_MEMBERS_ALIAS = f'''
Напиши як зберегти контакт до бази даних, щоб його було зручно ідентифікувати?
<i>Наприклад:  %s </i>
👇
'''
ALIAS_CONFIRMATION = '''
Перевір уважно, контакт буде збережено до бази даних як: <b>%s</b>
'''
ADDED_TO_MEMBERS = '''
%s <b>%s</b> приєднується до категорії <b>%s</b>!
'''
ADDED_TO_BLACK_LIST = '''
🚷️ Контакт <b>%s</b> +<i>%s</i> внесений до чорного списку.
'''
ACCESS_ALLOWED = '''
Вітаю, тобі надано доступ!
Тебе приєднано до категорії %s!
'''
ACCESS_DENIED = '''
На жаль, тобі відмовлено в доступі :(
Якщо ти вважаєш, що це помилка, зв'яжись з адміністрацією салону.   
'''
STICKER_CONGRATULATION = 'CAACAgIAAxkBAAJId2RuXwiM73WC1SUxULYF-Kl1gwTUAAJ3BQACP5XMCmWM0yxKQdlOLwQ'
STICKER_REGRET = 'CAACAgIAAxkBAAJK2GRxoqJc8s6BtUBabSCPiAxg0-LIAALzAANWnb0KahvrxMf6lv4vBA'

# ************************************************************************************************
#                                   THE SUPERUSER MESSAGES
# ************************************************************************************************
SUPERUSER_START_HELP = '''
<b>%s</b>, ти керівник цього боту, і тобі доступні наступні можливості: 
- перегляд та редагування робочих графіків майстрів;
- перегляд та редагування свої робочих записів (якщо вони в тебе є),
- надання майстрам доступу до власних графіків;
- делегування своїх повноважень адміністраторам.
'''

# ************************************************************************************************
#                         THE MANAGER (SUPERUSER + ADMIN) MESSAGES
# ************************************************************************************************
STAFF_LIST_HEADER = f"{STAFF_BADGE} <i>{STAFF}, зареєстрований в боті:</i> \n\n"
STAFF_LIST_ROW = '%s  <b>%s</b> %s \n'
NO_FILE = '❗[без файлу]'
NO_STAFF_YET = '''
Персоналу ще немає 🤷‍♂️️
Саме час когось запросити!
'''
PRE_INVITE = '''
Перешли в Telegram наступне повідомлення тому контакту, який хочеш запросити до нас!     
👇   👇   👇
'''
INVITE = '''
Привіт!
Я запрошую тебе до нашого боту.

Тисни сюди 👉🏻 @MyWorkScheduleBot та приєднуйся!
Твій промокод: %s   
'''
