START = """
Радий тебе вітати, %s 👋 
Я допоможу тобі структурувати твої робочі записи.
Можу нагадувати тобі про записи на сьогоднішній чи завтрішній \
день, про записи цього тижня чи наступного.
Більше того, можу привести тобі статистику за різний період.
Якщо хочеш, щоб я став твоїм помічником, то 
тисни сюди 👉🏻/client 
і почнемо.

Якщо ж ти хочеш стати моїм адміністратором, то 
тисни сюди 👉🏻/moderator 
і ми добре попрацюємо разом.

Якщо ж ти хочеш стати моїм керівником,  
тисни сюди 👉🏻/superuser  
і я буду радий тобі допомагати.
"""

CLIENT = """
Вже дуже хочу тобі бути корисним, але дивлячись на те, що \
інформація є конфіденційною, надішли запит адміністратору, \
що б він верифікував твої дані та надав тобі доступ.  
Вкажи своє ім'я та прізвище, чи ім'я і посаду, чи будь-який \
інший зрозумілий для нього ідентифікатор.   
"""

MODERATOR = """
Маю за честь працювати пліч-о-пліч з тобою, допоможи \
мені з адмініструванням. Думаю, наша співпраця буде плідною. \
Але спочатку, дивлячись на те, що інформація є конфіденційною, \
надішли запит нашому керівнику, щоб він надав тобі доступ.  
"""

SUPERUSER = """ 
Дуже радий, що мені випала честь працювати під твоїм \
керівництвом. Буду віддано виконувати покладені на мене \
зобов'язання. 
Якщо ти твої наміри не змінилися, скажи мені 'Так'
"""
