from typing import List

# from .actions.staff import Staff

__BOT_GREETING = '''
Радий вітати тебе 👋
Я бот, що допоможе тобі переглядати свої робочі записи.
Ти зможеш легко та швидко дізнатись від мене графік роботи на сьогодні чи завтра, 
цього тижня чи наступного.
Більше того, можу надавати тобі записи за різний період.
Якщо хочеш, щоб я став твоїм помічником, то скоріше
тисни на кнопку "Розпочати" в нижній частині екрану і почнемо 🤓
'''
SUPERUSER = 'керівник'
ADMIN = 'адміністратор'
EMPLOYEE = 'майстер'
START = f'''
Приємно познайомитись, <b>%s</b> 🖖 
Скажи мені, ким ти працюєш у нас?
'''
CONFIRM_ROLE = f'''
Твоя відповідь: <b>%s</b> 
'''
SENT_CONTACT = f'''
%s, як ти розумієш, інформація з графіками роботи майстрів є конфіденційною. \
Щоб отримати доступ до %s має перевірити твій контакт і авторизувати тебе.

В нижній частині екрану з'явилася кнопка <b>Відправити контакт для авторизації</b>, \
якщо ти її не бачиш, розшир клавіатуру, натиснувши на відповідну іконку \
з зображенням клавіатури, при цьому поле вводу тексту має бути пустим.     
'''
SENT_REQUEST = '''
Запит відправлено, зачекай ...
'''
NEW_USER_REQUEST = f'''
👆 👆 👆 Контакт <b>%s</b>
надіслав запит на приєднання до категорії <b>%s</b>.
'''
ASK_NAME = f'''
Напиши як його внести до бази даних?
<i>Наприклад:  %s %s</i>
👇
'''
INSERT_TO_USERS = f'''
Контакт <b>%s</b> внесений до бази даних!
'''
INSERT_TO_BLACKLIST = f'''
Контакт <b>%s</b> внесений до чорного списку.
'''
CONGRATULATION = '''
Вітаю, тобі надано доступ до записів!
'''
STICKER_CONGRATULATION = 'CAACAgIAAxkBAAJId2RuXwiM73WC1SUxULYF-Kl1gwTUAAJ3BQACP5XMCmWM0yxKQdlOLwQ'
REGRET = '''
На жаль, тобі відмовлено в доступі.
Якщо ти вважаєш, що це помилка, зв'яжись з адміністрацією закладу.   
'''
STICKER_REGRET = 'CAACAgIAAxkBAAJK2GRxoqJc8s6BtUBabSCPiAxg0-LIAALzAANWnb0KahvrxMf6lv4vBA'

# ***************************************************
# SUPERUSER MESSAGES
# ***************************************************
MSG_HELP_SUPERUSER = f'''
<b>%s</b>, ти мій керівник, a отже тобі доступні широкі можливості. 
<b>Ти можеш:</b>
- керувати адміністраторами;
- виконувати функції замість адміністратора;
- переглядати та редагувати робочі записи майстрів;
- переглядати та редагувати свої робочі записи (якщо вони в тебе є).  
'''
PRE_INVITE = f'''
Для запрошення <b>натисни</b> на повідомлення нижче 
та <b>відправ</b> його своєму контакту.
👇   👇   👇
'''
INVITE = f'''
Привіт!
Я запрошую тебе до нашого боту.
Тисни сюди 👉🏻 @MyWorkScheduleBot
і приєднуйся!  
'''
ACKNOWLEDGMENT_USERNAME = f'''
<b>"%s"</b>\n<i>Все вірно?</i>
'''
REPEAT_NAME_USER = '''
Добре, запиши по іншому 👇
'''


# def staff_text(data: List[Staff]) -> str:
#     if data:
#         text = ''
#         for i in data:
#             text = f'{i.name}'
#     else:
#         text = 'Персоналу ще немає 🤷‍♂️️\nСаме час когось запросити'
#     return text
