START = f"""
Радий тебе вітати тебе, <b>%s</b> 👋 

Я допоможу тобі структурувати твої робочі записи.
Можу нагадувати тобі про записи на сьогоднішній чи завтрішній \
день, про записи цього тижня чи наступного.
Більше того, можу привести тобі статистику за різний період.
Якщо хочеш, щоб я став твоїм помічником, то 
тисни на <b>Я майстер</b> і почнемо.

Якщо ж ти хочеш стати моїм адміністратором, то 
тисни на <b>Я адміністратор</b> і ми добре попрацюємо разом.
"""

POST_START = f"""
%s, дивлячись на те, що інформація є конфіденційною, \
надішли запит нашому %s, щоб він надав тобі доступ.  
"""
